Strg-Alt-Entf-0x00/esp-uart-filebridge/examples/basic_transfer/sdkconfig.defaults
# ============================================================================
# ESP32-P4 Hardware Target Configuration
# ============================================================================
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y

# ============================================================================
# Flash Configuration (32 MB QIO Mode)
# ============================================================================
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y

# ============================================================================
# Partition Table (Increased offset for larger bootloader)
# ============================================================================
CONFIG_PARTITION_TABLE_OFFSET=0x9000

# ============================================================================
# UART File Bridge Component Configuration
# ============================================================================
CONFIG_UART_FILEBRIDGE_NUM=1
CONFIG_UART_FILEBRIDGE_TX_PIN=30
CONFIG_UART_FILEBRIDGE_RX_PIN=31
CONFIG_UART_FILEBRIDGE_RTS_PIN=50
CONFIG_UART_FILEBRIDGE_CTS_PIN=29
CONFIG_UART_FILEBRIDGE_BAUD=3000000

# ============================================================================
# SD Card Configuration (For file storage)
# ============================================================================
CONFIG_UART_FILEBRIDGE_SD_MOUNT_POINT="/sd"
CONFIG_UART_FILEBRIDGE_SD_MAX_FILES=5
